fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВКМ_НачисленияЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.ВКМ_Удержания</xr:Item>
				<xr:Item>CalculationRegister.ВКМ_ДополнительныеНачисления</xr:Item>
				<xr:Item>CalculationRegister.ВКМ_ОсновныеНачисления</xr:Item>
				<xr:Item>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерОклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВКМ_УсловияОплатыСотрудников</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентОтРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьДанныеСотрудника(Сотрудник, ДатаАктуальности)
	
	Результат = Новый Структура("Оклад, Процент", 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Условия.Оклад КАК Оклад,
		|	Условия.ПроцентОтРабот КАК Процент
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК Условия";
	
	// Используем КонецДня, если нужно цеплять изменения внутри дня
	Запрос.УстановитьПараметр("Период", ДатаАктуальности); 
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.Оклад = Выборка.Оклад;
		Результат.Процент = Выборка.Процент;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Процедура НачисленияСотрудникПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Начисления.ТекущиеДанные;
	ЗаполнитьПоказателиСтроки(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияВидРасчетаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Начисления.ТекущиеДанные;
	ЗаполнитьПоказателиСтроки(СтрокаТабличнойЧасти);	
	
КонецПроцедуры     

&НаКлиенте
Процедура ЗаполнитьПоказателиСтроки(СтрокаТабличнойЧасти)
	
	Если СтрокаТабличнойЧасти = Неопределено 
		ИЛИ Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Сотрудник) 
		ИЛИ Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ВидРасчета) Тогда
		Возврат;
	КонецЕсли;
	
	Данные = ПолучитьДанныеСотрудника(СтрокаТабличнойЧасти.Сотрудник, Объект.Дата);
	
	ОкладСсылка = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад");
	// Внимание: проверьте имя предопределенного узла для Процента. 
	// Обычно процент — это Дополнительное начисление, но если вы добавили его в Основные:
	ПроцентСсылка = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.Процент"); 
	
	Если СтрокаТабличнойЧасти.ВидРасчета = ОкладСсылка Тогда
		СтрокаТабличнойЧасти.РазмерОклад = Данные.Оклад; // Проверьте, что имя колонки именно "РазмерОклад"
	ИначеЕсли СтрокаТабличнойЧасти.ВидРасчета = ПроцентСсылка Тогда
		СтрокаТабличнойЧасти.РазмерОклад = Данные.Процент;
	КонецЕсли;
	
КонецПроцедуры
